validation/REDIM-Le1-SWQ/coarse/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet1 
    {
        type            groovyBC;
        value           uniform (0 1.7 0);
	variables	"u_prof=680*pos().x-68000*pos().x*pos().x;";
	valueExpression	"vector(0,u_prof,0)";
    }

    inlet2
    {
        type            fixedValue;
        value           uniform (0 1.7 0);
    }

    inlet3
    {
        type            fixedValue;
        value           uniform (0 3.810975 0);
    }

    edge
    {
	type		zeroGradient;
    }

    wall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    frontAndBackPlanes 
    {
        type            empty;
    }
}


// ************************************************************************* //
