validation/REDIM-Le1-SWQ/coarse/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inlet1
    {
        type            zeroGradient;
    }

    inlet2
    {
        type            zeroGradient;
    }

    inlet3 
    {
        type            zeroGradient;
    }

    edge
    {
        type            waveTransmissive;
	fieldInf	101325;
	lInf		0.5;
	value		uniform 101325;
	gamma		1.4;
    }

    wall
    {
	type		zeroGradient;
    }

    outlet
    {
        type            waveTransmissive;
	fieldInf	101325;
	lInf		0.5;
	value		uniform 101325;
	gamma		1.4;
    }

    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
