validation/REDIM-Le1-SWQ/coarse/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue theta1 1
    volScalarFieldValue theta2 97
);

regions
(
    boxToCell
    {
        box (0.006 0 0) (0.03 0.002 0.002);

        fieldValues
        (
   		volScalarFieldValue theta1 101
        );
    }
);

// ************************************************************************* //
